cases/low/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
440
(
0.673676
0.725448
0.777223
0.829
0.88078
0.54199
0.583642
0.625297
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
-5
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
5
5
5
5
5
5
5
5
5
5
5
5
5
5
5
5
5
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-4.59899
-3.79698
-2.99497
-2.19296
-1.39095
-0.890954
-0.692964
-0.494974
-0.296985
-0.0989949
0.0989949
0.296985
0.494974
0.692964
0.890954
1.39095
2.19296
2.99497
3.79698
4.59899
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
1.39095
2.19296
2.99497
3.79698
4.59899
0.0989949
0.296985
0.494974
0.692964
0.890954
-0.890954
-0.692964
-0.494974
-0.296985
-0.0989949
-4.59899
-3.79698
-2.99497
-2.19296
-1.39095
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.993844
0.969373
0.921032
0.850012
0.758062
0.647446
0.520888
0.381504
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
