cases/low/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
440
(
0.788773
0.84939
0.910011
0.970635
1.03126
0.884448
0.952417
1.02039
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
1.14095
1.44296
1.74497
2.04698
2.34899
0.0989949
0.296985
0.494974
0.692964
0.890954
-0.890954
-0.692964
-0.494974
-0.296985
-0.0989949
-1.37249
-1.11746
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
17
(
-1.37249
-1.11746
-0.890954
-0.692964
-0.494974
-0.296985
-0.0989949
0.0989949
0.296985
0.494974
0.692964
0.890954
1.14095
1.44296
1.74497
2.04698
2.34899
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
-1.5
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
2.5
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0782173
0.232726
0.381504
0.520888
0.647446
0.758062
0.850011
0.921031
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
