cases/low/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.005;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //


functions
{

    UminMag
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             yes;
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        cellZone        all;
        operation       minMag;
        fields          (U);
    }

    UmaxMag
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             yes;
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        cellZone        all;
        operation       maxMag;
        fields          (U);
    }

    pMin
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             yes;
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        cellZone        all;
        operation       min;
        fields          (p);
    }

    pMax
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             yes;
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        cellZone        all;
        operation       max;
        fields          (p);
    }

    forces1
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
    }

    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1;
        lRef            2;
        Aref            2;
    }
}
